# StructuralSectionPipeStandard Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralSectionPipeStandard Class
Members See Also
---
Defines parameters for pipes also known as RoundHSS or HollowStructuralSection (HSS).
**Namespace:** Autodesk.Revit.DB.Structure.StructuralSections**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public class StructuralSectionPipeStandard : StructuralSectionGeneralR
```

Visual Basic
---
```text
Public Class StructuralSectionPipeStandard _
	Inherits StructuralSectionGeneralR
```

Visual C++
---
```text
public ref class StructuralSectionPipeStandard : public StructuralSectionGeneralR
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSection Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSectionRound Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSectionGeneralR Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSectionPipeStandard
# See Also
StructuralSectionPipeStandard Members
Autodesk.Revit.DB.Structure.StructuralSections Namespace